# 데이터프레임 고급 인덱싱

* loc : 라벨값 기반의 2차원 인덱싱

* iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [6]:
df.loc["a":"b"]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [7]:
df.loc["c"]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [9]:
df.loc[["b", "c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [10]:
df.loc[df.A > 12]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [11]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [12]:
df.loc["a", "A"]

10

In [13]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [14]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [15]:
df.iloc[0, 1]

11

In [16]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [17]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [27]:
df1 = pd.DataFrame(np.arange(1,26).reshape(5,5), 
                      index = [i for i in range(1,6)],
                      columns = ["A", "B", "C", "D", "E"])
df1

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [28]:
df1.iloc[0,0]

1

In [34]:
df1.loc[df1.A>10]

    A   B   C   D   E
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [37]:
df1.loc[3:5]

    A   B   C   D   E
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [38]:
df1.loc[3,"A"]

11

In [40]:
df1.loc[1,"A"]

1

In [42]:
df1.loc[4:5, "D":]

    D   E
4  19  20
5  24  25

In [46]:
df1.loc[5, "B"]

22

In [49]:
df1.iloc[-1]

A    21
B    22
C    23
D    24
E    25
Name: 5, dtype: int32